<template>
  <section class="info">
    <div class="container">
      <div class="card">
        <h1>سياسة الخصوصية</h1>
        <p>
          إنّ خصوصيتك مهمة بالنسبة لنا. يوضّح إشعار الخصوصية هذا البيانات
          الشخصية التي نعالجها، وكيف نعالجها وأسبابها. يجب قراءة إشعار الخصوصية
          مع شروط الاستخدام وأي مستندات أخرى مشار إليها فيه. يرجى ملاحظة أننا
          سنطلب موافقتك قبل استخدام بياناتك الشخصية لأغراض أُخرى غير تلك المنصوص
          عليها في إشعار الخصوصية هذا.
        </p>
        <div class="question">
          <h2>إشعار الخصوصية</h2>
          <p>
            <span> تمهيد </span>نحن شركة تأثير +، وهي منشأة قانونية تقع في
            المملكة العربية السعودية مسؤولة عن بناء مدينة تأثير +. وبصفتنا منشأة
            تجارية، فنحن نلتزم بقوانين المملكة العربية السعودية والقوانين
            والأنظمة الدولية التي قد يتحتّم على شركة تأثير + الالتزام بها.
            ويُوضح هذا الإشعار طريقة تعاملنا مع بياناتك وكيف نحمي خصوصيتك. شركة
            تأثير + مسؤولة عن ضمان التالي:
          </p>
          <ul>
            <li>
              جمع البيانات الشخصية الضرورية لحصولك على الخدمة أو لنتمكن من
              التواصل معك فقط
            </li>
            <li>الحفاظ على أعلى المعايير اللازمة لحماية بياناتك لشخصية</li>
          </ul>
          <p>
            <span> للتواصل معنا: </span>
            يُراقب مكتب خصوصية البيانات امتثال شركة تأثير + للقانون ويُقدم
            المشورة. وإذا كانت لديك أي أسئلة أو استفسارات حول طريقة معالجتنا
            لبياناتك الشخصية، فيرجى التواصل معنا على البريد الإلكتروني لمكتب
            خصوصية البيانات:
          </p>
        </div>

        <div class="question">
          <h2>ما هي البيانات الشخصية التي نجمعها؟</h2>
          <p>
            البيانات الشخصية هي كل معلومة تُحدد هوية شخصٍ ما وتتعلق به شخصياً.
            وقد تتضمن بيانات منفصلةً إذا اجتمعت مع غيرها من البيانات حددت هوية
            الشخص.<br />
            وفي تأثير +، وتماشياً مع سياسة تقليل البيانات، فإننا نجمع البيانات
            الشخصية عند الحاجة إليها فقط. وقد تختلف هذه البيانات بناءً على طبيعة
            علاقتك مع تأثير +.<br />
            <span>ونحن عادةً نجمع البيانات التالية:</span>
            <ul>
              <li>الاسم</li>
              <li>معلومات التواصل كرقم الهاتف والبريد الإلكتروني وعنوان السكن، ونحوها</li>
              <li>صور كاميرات المراقبة الملتقطة في مقراتنا</li>
              <li>البيانات التي تُقدمها أنت لنا والمطلوبة للوصول إلى أنظمتنا والتمتع بخدماتنا</li>
              <li>البيانات التقنية (مثل عنوان بروتوكولات الإنترنتIP وملفات تعريف الارتباط أو بيانات تقنية مرتبطة بخدمةٍ أو نظام معين)</li>
              <li>إذا تقدمت لوظيفة لدينا، فإننا سنجمع بيانات إضافية مثل التاريخ الوظيفي وتاريخ الميلاد والجنسية وغيرها من المعلومات ذات الصلة من أجل إجراءات فحص الخلفية</li>
            </ul>
          </p>
        </div>

        <div class="question">
          <h2>من أين نحصل على بياناتك الشخصية؟</h2>
          <p>
            نحصل على معظم البيانات الشخصية من المصادر التالية: 
            <br>
            <ul>
              <li>عندما تزور موقعنا الإلكتروني، نجمع بياناتٍ عنك عبر تفاعلاتك معنا</li>
              <li>التقنية التي تستخدمها للوصول إلى أنظمتنا والتمتع خدماتنا</li>
              <li>المزكّيين والوسطاء</li>
              <li>أرباب العمل</li>
              <li>البيانات من المصادر المتاحة للجميع ضمن حدود القانون</li>
              <li>في بعض الحالات، قد نجمع البيانات من مصادر إضافية إلى جانب ما ذكرناه آنفاً (مثل بيانات فحص الخلفية التي تتطلبها إجراءات التوظيف)</li>
            </ul>
          </p>
        </div>

        <div class="question">
          <h2>ما حاجاتنا لبياناتك الشخصية؟</h2>
          <p>
           نستخدم البيانات الشخصية للغاية التي جُمعت لأجلها وحسب، وقد نحتاج لاستخدام بياناتك من أجل:
           <br>
           <ul>
            <li>إنجاز بعض الأعمال الداخلية كالتحويلات البنكية للشركة والمراجعات الحسابة وتحليل البيانات</li>
            <li>الوفاء بالمتطلبات القانونية أو التعاقدية</li>
            <li>الحفاظ على السلامة العامة والأمان داخل المنشأة</li>
            <li>تزويدك بالخدمات وتوفير الدعم</li>
            <li>منحك صلاحية الوصول إلى أنظمتنا لتمكينك من التمتع بخدماتنا</li>
            <li>التعرف على الجوانب التي لا تلقى استحسانك في خدماتنا</li>
            <li>المساعدة في البحث والتخطيط لخدمات جديدة أو تطوير الخدمات الحالية</li>
            <li>تفادي الاحتيال والجرائم والمساعدة في الكشف عنها</li>
           </ul>
          </p>
          <p>
            استخدامنا لملفات تعريف الارتباط في موقعنا الإلكتروني <br>
            نحتفظ أحياناً على حاسوبك أو أجهزتك الأخرى ببعض الملفات الصغيرة التي تُعرف بملفات تعريف الارتباط، فنجمع إحصائيات الإنترنت حول زيارتك لموقعنا بناءً على عنوان برتوكولات الإنترنت IP في جهازك. ونستخدم هذه البيانات لتحسين تجربتك في استخدام موقعنا الإلكتروني.
          </p>
        </div>

        <div class="question">
          <h2>مع من نُشارك بياناتك الشخصية؟</h2>
          <p>
          نُشارك البيانات عند الحاجة إلى ذلك فقط وبما يتماشى مع الأنظمة واللوائح. فمثلاً:
          <br>
          <ul>
            <li>نُضطر أحياناً بموجب بعض المهام القانونية إلى توفير بعض البيانات الشخصية إلى جهات أخرى، وتتضمن هذه المهام الإفصاح عن البيانات حسب القانون والكشف عن حالات الاحتيال والغش أو تفاديها</li>
            <li>قد نُشارك بياناتك الشخصية مع مجموعة من الجهات لتخزينها أو لمساعدتنا في توفير خدماتنا للمستفيدين. وحين نفعل ذلك، فإننا نحرص على توقيع اتفاقية تضمن أن تمتثل الجهة لقانون حماية البيانات لإبقاء بياناتك بأمان</li>
            <li>نُشارك بعض البيانات الشخصية داخل شركة تأثير + لضمان نجاح الخدمات التي نُقدمها</li>
          </ul>

        </p>
       <p>

         عندما نُشارك بياناتك، فإننا نحرص أن تتمتع الشركة التي أرسلناها إليها بالمستوى المطلوب من حماية البيانات، كما نتخذ إجراءات إضافية لحمايتها.
       </p>
        </div>

        <div class="question">
          <h2>كيف نحمي بياناتك؟</h2>
          <p>
           نعمل جاهدين لنضمن أن السجلات المتوفرة لدينا عنك محفوظةٌ في مكانٍ آمن وأنها مُتاحة فقط لمن يحق لهم الاطلاع عليها. وإحدى الطرق التي نتبعها للحفاظ على هذه السجلات هي اتخاذ إجراءات فنية وتنظيمية. فعلى سبيل المثال:
           <br>
           <ul>
            <li>تقييد الوصول إلى الأنظمة والشبكات</li>
            <li>تدريب الموظفين على طريقة إبقاء بياناتك بأمان</li>
            <li>وضع ضوابط وقوانين على أماكن تخزين البيانات</li>
            <li>التخلص من البيانات الشخصية عندما انقضاء الحاجة منها</li>
           </ul>
          </p>
        </div>

        <div class="question">
          <h2>كم تبقى بياناتك لدينا؟</h2>
          <p>
          نحتفظ ببيانتك الشخصية طيلة فترة حاجتنا إليها للغرض الذي جُمعت لأجله ولأجل الوفاء بأي متطلبات قانونية أو رقابية أو حسابية أو لأجل إعداد التقارير، وذلك بناءً على مدة تخزين محددة. وقد تختلف المدة حسب ظروف صاحب البيانات. كما نُراجع المدة باستمرارٍ لنضمن ألا تبقى بياناتك لدينا وقتاً أطول من اللازم.
          <br>
          حقوقك فيما يتعلق بجمعنا لبياناتك الشخصية واستخدامها
          <br>
          بموجب القوانين المعمول بها، قد يكون لديك حقوقٌ محددةٌ فيما يتعلق ببياناتك الشخصية، ومن هذه الحقوق:
          <br>
          <ul>
            <li>إمكانية الوصول إلى بيناتك الشخصية التي نحتفظ بها</li>
            <li>الحصول على بيانتك الشخصية التي تحتفظ بها شركة تأثير +</li>
            <li>معرفة الغرض الذي جُمعت بيناتك الشخصية لأجله وكيف ستُستخدم</li>
            <li>تقييد استخدام بياناتك الشخصية في بعض الحالات</li>
            <li>تعديل وتحديث بياناتك الشخصية التي تحتفظ بها شركة تأثير +</li>
            <li>طلب حذف بياناتك الشخصية التي تحتفظ بها شركة تأثير +</li>
            <li>التراجع عن موافقتك لاستخدام بياناتك والاعتراض على ذلك</li>
          </ul>
          </p>
          <span>قد تخضع الحقوق المذكورة أعلاه لبعض الاستثناءات، منها:</span>
          <ul>
            <li>عندما يتعارض طلبك مع إجراءٍ قانوني (مثلا: نحتاج لمعالجة بياناتك وفقاً لقانون العمل)</li>
            <li>عندما يتعذر تنفيذ اتفاق أو إبرام عقد دون موافقتك على مشاركة بياناتك</li>
            <li>عندما لا نكون نحن الجهة المسؤولة عن بياناتك (في هذه الحالة، نستطيع تزويدك بمعلومات عن الجهة المسؤولة عن بياناتك ومساعدتك في تحويل طلبك إليها)</li>
            <li>عندما تتعلق بياناتك بجريمة محتملة (مثلا: قد تكون بياناتك ذات أهمية لمنع حدوث جريمة أو الكشف عنها كجرائم الاحتيال وغسيل الأموال أو التحويلات المالية المشبوهة)</li>
            <li>عندما تكون بيناتك ضرورية لرفع الدعاوى القانونية أو الدفاع عنها أو ممارستها
          </li>
          </ul>
        </div>

         

        <div class="question">
          <h2>كيف تُطالب بحقوقك؟</h2>
          <p>
        يُمكنك المطالبة بأي من هذه الحقوق أو الاستفسار عن طريقة استخدامنا لبياناتك الشخصية أو تقديم شكوى عبر مراسلتنا على البريد الإلكتروني التالي:
          البريد الإلكتروني:
          <br>
          التغييرات في إشعار الخصوصية
          <br>         
          في المستقبل، قد نُراجع أو نُعدل إشعار الخصوصية هذا في أي وقت وذلك بتعديل هذه الصفحة. جميع التغييرات ستُجرى هنا لذا بإمكانك دائماً معرفة البيانات التي نجمعها وكيف قد نستخدمها وما إذا كنا سنُفصح عنها لأي جهة.
          </p>
        </div>
 

        
      </div>
    </div>
  </section>
</template>

<style lang="scss" scoped>
@import "../../scss/variables.scss";
.info {
  width: 100%;
  background-color: rgba(250, 235, 215, 0.245);
  // height: 500px;
  padding: 50px;
  .card {
    background-color: #fff;
    padding: 50px;
    width: 100%;
    height: 100%;
    margin-top: 100px;
    h1 {
      color: #233a76;
      font-size: 50px;
      font-weight: 400;
    }
    p {
      color: #233a76;
      font-size: 20px;
      font-weight: 400;
      line-height: 39.5px;
      word-wrap: break-word;
      padding: 50px;
    }
   
    .question {
      margin: 20px 0px;
      h2 {
        color: #233a76;
        font-size: 24px;
        font-weight: 800;
        // line-height: 39.5px;
        word-wrap: break-word;
        padding: 0%;

      }
      p {
        color: #233a76;
        font-size: 20px;
        font-weight: 400;
        line-height: 39.5px;
        word-wrap: break-word;
        padding: 10px;
      }
       ul {
      padding: 0% 20px;
      margin: 0%;
      li {
        color: #233a76;
        font-size: 20px;
        font-weight: 500;
        list-style: outside;
        margin: 10px 20px;
      }
    }
    span {
      display: block;
      color: #233a76;
      font-size: 20px;
      font-weight: 600;
      margin: 0px;
    }
    }
  }
}

@media (max-width: 575.98px) {
  .info {
    padding: 50px 0px;
    .container {
      width: 100% !important;
    }
    .card {
      padding: 20px 0px;
      h1,
      .question h2 {
        padding: 10px;
      }
    }
  }
}
@media (min-width: 576px) and (max-width: 767.98px) {
  .info {
    padding: 50px 0px;
    .container {
      width: 100% !important;
    }
    .card {
      padding: 20px 0px;
      h1,
      .question h2 {
        padding: 10px;
      }
    }
  }
}
</style>

<script>
export default {
  name: "PrivacyPolicyComponent",
};
</script>
